golang/leetcode/27_LeetCode628.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 四 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LeetCode628-三个数的最大乘积</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'/>
</head>
<body>
<div id="content">
<h1 class="title">LeetCode628-三个数的最大乘积</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2d3d050">1. 题目</a></li>
<li><a href="#org2e52b13">2. 解答</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2d3d050" class="outline-2">
<h2 id="org2d3d050"><span class="section-number-2">1</span> 题目</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
 给定一个整型数组，在数组中找出由三个数组成的最大乘积，并输出这个乘积。

示例 1:

输入: [1,2,3]
输出: 6
示例 2:

输入: [1,2,3,4]
输出: 24
注意:

给定的整型数组长度范围是[3,104]，数组中所有的元素范围是[-1000, 1000]。
输入的数组中任意三个数的乘积不会超出32位有符号整数的范围

</pre>
</div>
</div>
<div id="outline-container-org2e52b13" class="outline-2">
<h2 id="org2e52b13"><span class="section-number-2">2</span> 解答</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-go">  <span style="color: #81A1C1;">package</span> main

<span style="color: #81A1C1;">import</span>(
        <span style="color: #A3BE8C;">"fmt"</span>
        <span style="color: #A3BE8C;">"sort"</span>
)

<span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">maximumProduct</span>(<span style="color: #D8DEE9;">nums</span> []<span style="color: #8FBCBB;">int</span>) <span style="color: #8FBCBB;">int</span> {
        sort.<span style="color: #8FBCBB;">Ints</span>(nums)
        <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#19977;&#20010;&#25968;&#26368;&#22823; , &#25490;&#24207;&#23436;&#20102; &#26368;&#22823;&#30340;3&#20010;&#20056;</span>
        <span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#22914;&#26524;&#26377; &#36127;&#25968; &#36824;&#35201;&#26368;&#22823; &#37027;&#23601;&#21482;&#33021;&#26377;&#20004;&#20010;&#36127;&#25968;  &#20004;&#20010;&#30340;&#35805; &#23601;&#26159; &#26368;&#38752;&#21069;&#30340;&#20004;&#20010;&#36127;&#25968;+&#26368;&#22823;&#30340;&#27491;&#25968;</span>
        <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#36824;&#26377;&#19968;&#31181; 3&#20010;&#37117;&#26159;&#36127;&#25968; &#37027;&#26679;&#23601;&#21482;&#33021;&#21462; &#26368;&#22823;&#30340;&#19977;&#20010;&#36127;&#25968;</span>
        <span style="color: #D8DEE9;">i</span> := nums[<span style="color: #81A1C1;">len</span>(nums)-1] * nums[<span style="color: #81A1C1;">len</span>(nums)-2] * nums[<span style="color: #81A1C1;">len</span>(nums)-3]

        <span style="color: #D8DEE9;">j</span> := nums[0]*<span style="color: #8FBCBB;">nums</span>[1]*<span style="color: #8FBCBB;">nums</span>[<span style="color: #81A1C1;">len</span>(nums)-1]

        fmt.<span style="color: #8FBCBB;">Println</span>(nums)

        <span style="color: #81A1C1;">if</span> i&gt;j {
                <span style="color: #81A1C1;">return</span> i
        }<span style="color: #81A1C1;">else</span>{
                <span style="color: #81A1C1;">return</span> j
        }
}

<span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">main</span>() {

        <span style="color: #D8DEE9;">arr</span> := []<span style="color: #8FBCBB;">int</span>{-1,-2,-3,-4}

        <span style="color: #D8DEE9;">a</span> := <span style="color: #8FBCBB;">maximumProduct</span>(arr)
        fmt.<span style="color: #8FBCBB;">Println</span>(a)
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-16</p>
<p class="author">Author: rzry</p>
<p class="date">Created: 2020-12-03 四 15:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
